In [2]:
import pandas as pd

In [6]:
df = pd.read_csv(r"C:\Users\mihir\titanic.csv")
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [9]:
df.drop(['Name','Siblings/Spouses Aboard','Parents/Children Aboard'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [10]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [11]:
#inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2}

In [12]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [13]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [14]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [15]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [16]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    27.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [17]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [18]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [19]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [20]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [21]:
model.score(X_test,y_test)

0.7565543071161048

In [22]:
X_test[0:10]

     Pclass   Age     Fare  female
613       3  34.0  14.4000       0
755       1  33.0  86.5000       1
180       2  39.0  15.0500       0
610       3  22.0   7.7500       0
509       1  36.0  26.2875       0
131       3  47.0  14.5000       1
203       3  18.0   8.0500       0
179       3   8.0  69.5500       1
845       1  40.0  89.1042       1
418       3  21.0   7.7333       0

In [23]:
y_test[0:10]

613    0
755    1
180    0
610    0
509    1
131    0
203    1
179    0
845    1
418    0
Name: Survived, dtype: int64

In [24]:
model.predict(X_test[0:10])

array([0, 1, 0, 0, 0, 1, 0, 1, 1, 0], dtype=int64)

In [25]:
model.predict_proba(X_test[:10])

array([[0.96488069, 0.03511931],
       [0.00757305, 0.99242695],
       [0.92745278, 0.07254722],
       [0.95987331, 0.04012669],
       [0.75143125, 0.24856875],
       [0.34629807, 0.65370193],
       [0.95786403, 0.04213597],
       [0.09627557, 0.90372443],
       [0.00700046, 0.99299954],
       [0.95938256, 0.04061744]])

In [26]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.776     , 0.78225806, 0.75806452, 0.81451613, 0.79674797])